In [1]:
import pandas as pd
# Install a pip package in the current Jupyter kernel
import sys
!{sys.executable} -m pip install scipy

Requirement already satisfied: scipy in ./.venv/lib/python3.9/site-packages (1.7.1)
Requirement already satisfied: numpy<1.23.0,>=1.16.5 in ./.venv/lib/python3.9/site-packages (from scipy) (1.19.5)

In [2]:
data = pd.read_csv('data/dataset.csv')

In [12]:
sample = data.sample(33)
sample.head()

,objid,ra,dec,u,g,r,i,z,run,rerun,camcol,field,specobjid,class,redshift,plate,mjd,fiberid
6416,1.237650e+18,11.368378,14.703752,19.33779,18.32987,17.93420,17.82492,17.73175,1035,301,3,39,6.984080e+18,STAR,-0.000774,6203,56266,454
4726,1.237650e+18,131.952629,52.589983,18.54162,17.24359,16.53755,16.16176,15.92815,1345,301,4,168,5.034100e+17,GALAXY,0.086951,447,51877,482
5120,1.237650e+18,184.353008,-1.736801,19.43036,18.26814,17.70304,17.36375,17.18789,1140,301,5,210,3.750370e+17,GALAXY,0.088079,333,52313,410
4013,1.237650e+18,160.215744,1.096871,19.44259,18.00743,17.25014,16.84793,16.59558,756,301,6,296,3.086410e+17,GALAXY,0.106391,274,51913,527
2279,1.237650e+18,151.332755,0.275259,19.36382,18.08251,17.33688,16.97474,16.66946,756,301,4,237,3.030020e+17,GALAXY,0.125232,269,51910,492

In [24]:
sect1 = pd.DataFrame({
	x: sample[x] for x in ['ra', 'dec', 'class']
})
sect1.head()

              ra        dec   class
6416   11.368378  14.703752    STAR
4726  131.952629  52.589983  GALAXY
5120  184.353008  -1.736801  GALAXY
4013  160.215744   1.096871  GALAXY
2279  151.332755   0.275259  GALAXY

In [25]:
sect2 = pd.DataFrame({
	x: sample[x] for x in ['u', 'g', 'r', 'i', 'z', 'class']
})
sect2.head()

             u         g         r         i         z   class
6416  19.33779  18.32987  17.93420  17.82492  17.73175    STAR
4726  18.54162  17.24359  16.53755  16.16176  15.92815  GALAXY
5120  19.43036  18.26814  17.70304  17.36375  17.18789  GALAXY
4013  19.44259  18.00743  17.25014  16.84793  16.59558  GALAXY
2279  19.36382  18.08251  17.33688  16.97474  16.66946  GALAXY

In [26]:
sect3 = pd.DataFrame({
	x: sample[x] for x in ['run', 'rerun', 'camcol', 'field', 'specobjid', 'class']
})
sect3.head()

       run  rerun  camcol  field     specobjid   class
6416  1035    301       3     39  6.984080e+18    STAR
4726  1345    301       4    168  5.034100e+17  GALAXY
5120  1140    301       5    210  3.750370e+17  GALAXY
4013   756    301       6    296  3.086410e+17  GALAXY
2279   756    301       4    237  3.030020e+17  GALAXY

In [27]:

sect4 = pd.DataFrame({
	x: sample[x] for x in ['redshift', 'plate', 'mjd', 'fiberid', 'class']
})
sect4.head()

      redshift  plate    mjd  fiberid   class
6416 -0.000774   6203  56266      454    STAR
4726  0.086951    447  51877      482  GALAXY
5120  0.088079    333  52313      410  GALAXY
4013  0.106391    274  51913      527  GALAXY
2279  0.125232    269  51910      492  GALAXY